app/controllers/items_controller.rb

  def index
    begin
      @items = Item.page(params[:page] || 1).per(params[:per_page_item] || 10)

      @count = Item.count
---
SELECT COUNT(*) FROM "items"
SELECT "items".* FROM "items" LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]

  def show
    begin
      @item = Item.find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @item = Item.new(item_params)

    if @item.save
---
INSERT INTO "items" ("title", "description", "archived", "readed", "executed", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    begin
      @item = Item.find(params[:id])
      @item.update(
        title: params[:title],
        description: params[:description],
        archived: params[:archived],
        readed: params[:readed],
        executed: params[:executed],
        status: params[:status]
      )
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "title" = $1, "description" = $2, "executed" = $3, "updated_at" = $4 WHERE "items"."id" = $5  [["title", "test title2"], ["description", "test description2"], ["executed", true], ["updated_at", "2022-05-04 16:33:59.398157"], ["id", 2]]

  def destroy
    begin
      @item = Item.find(params[:id])
      if @item
        @item.destroy
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 3]]

  def listforstatus
    @items = Item.where(status: params[:status])
---
SELECT "items".* FROM "items" WHERE "items"."status" = $1 LIMIT $2  [["status", 1], ["LIMIT", 1]]